/*******************************(C) COPYRIGHT 2017 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : App_Lora.c
* @Description : None
* @Date        : 2017/10/17
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.20 (STM32L151CB)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 ----------------------------------------------------------------*/
#include "App_Lora.h"

/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 ------------------------------------------------------*/

/* 全局变量定义 --------------------------------------------------------------*/

/* 全局变量声明 --------------------------------------------------------------*/

/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------
* @FunctionName  : Lora()
* @Description   : None
* @Data          : 2016/8/8
* @Explain       : None
------------------------------------------------------------------------------*/
void Lora_Main(void)
{ 
	if(Key_State_Get(0,KEY_MODE_SHORT))
	{    
		EnableMaster = !EnableMaster; 
		
		LED_Temp_Set(1,100,LED_MODE_FLASH,3);  
		Key_State_Clear(0); 
	}
	
    if(EnableMaster == true)
    {
        OnMaster();	
    }
    else
    {
        OnSlave();	
    } 
}	
	
void Lora_Start(void)
{
    SX1276_Init();
}

Type_AppList App_Lora = {Lora_Main, NULL, Lora_Start, NULL, \
                         OS_STATE_ACTIVE, OS_THREAD_FREE, \
                         (uint8_t *)"Lora", 100
                        };


/*******************************(C) COPYRIGHT 2017 Wind（谢玉伸）*********************************/




